Revit 2026 API

# Transform1DOfPoint Method

---

Applies the transformation to the 1-dimensional point and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double OfPoint(
	double point
)
```
```vb
Public Function OfPoint (
	point As Double
) As Double
```
```cpp
public:
double OfPoint(
	double point
)
```
```fsharp
member OfPoint :
        point : float -> float
```

#### Parameters

point Double
     The point to transform.

#### Return Value

Double The transformed point.

Transformation of a point is affected by the translational part of the transformation.

#### Reference

Transform1D Class

Autodesk.Revit.DB Namespace